## Dataframe Baiscs

In [1]:
import pandas as pd

#### Creating Dataframe from csv file

In [ ]:
df = pd.read_csv('Filepath/filename.csv')

#### Creating the Dataframe using Dictionary.

In [2]:
weather_df = {
            'day':['1/1/2017','1/2/2017','1/3/2017','1/4/2017','1/5/2017','1/6/2017'],
            'temprature':[32,35,28,24,32,31],
            'windspeed':[6,7,2,7,4,2],
            'event':['Rain', 'Sunny' , 'Snow', 'Snow', 'Rain', 'Sunny']
}

In [3]:
df = pd.DataFrame(weather_df)

In [4]:
df

        day  temprature  windspeed  event
0  1/1/2017          32          6   Rain
1  1/2/2017          35          7  Sunny
2  1/3/2017          28          2   Snow
3  1/4/2017          24          7   Snow
4  1/5/2017          32          4   Rain
5  1/6/2017          31          2  Sunny

In [6]:
df.shape

(6, 4)

In [7]:
df.head() # To get the first 5 records of dataframe

        day  temprature  windspeed  event
0  1/1/2017          32          6   Rain
1  1/2/2017          35          7  Sunny
2  1/3/2017          28          2   Snow
3  1/4/2017          24          7   Snow
4  1/5/2017          32          4   Rain

In [8]:
df.head(2)

        day  temprature  windspeed  event
0  1/1/2017          32          6   Rain
1  1/2/2017          35          7  Sunny

In [22]:
df.tail() # toc look last 5 records of dataframe

        day  temprature  windspeed  event
1  1/2/2017          35          7  Sunny
2  1/3/2017          28          2   Snow
3  1/4/2017          24          7   Snow
4  1/5/2017          32          4   Rain
5  1/6/2017          31          2  Sunny

In [21]:
df.tail(2) # to look last 2 records

        day  temprature  windspeed  event
4  1/5/2017          32          4   Rain
5  1/6/2017          31          2  Sunny

##### <b> Indexing and Dicing Dataframe

In [12]:
df[2:5] # Excluede rown number 5

        day  temprature  windspeed event
2  1/3/2017          28          2  Snow
3  1/4/2017          24          7  Snow
4  1/5/2017          32          4  Rain

In [15]:
df.columns

Index(['day', 'temprature', 'windspeed', 'event'], dtype='object')

In [20]:
df['event'][2:5]

2    Snow
3    Snow
4    Rain
Name: event, dtype: object

In [25]:
 # Showing only few columns
df[['event','day']]

   event       day
0   Rain  1/1/2017
1  Sunny  1/2/2017
2   Snow  1/3/2017
3   Snow  1/4/2017
4   Rain  1/5/2017
5  Sunny  1/6/2017

In [32]:
df[['event','day']][2:4]

  event       day
2  Snow  1/3/2017
3  Snow  1/4/2017

#### <b> Basic Data stats

In [27]:
# Toc check the datatype of each column and get summary
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   day         6 non-null      object
 1   temprature  6 non-null      int64
 2   windspeed   6 non-null      int64
 3   event       6 non-null      object
dtypes: int64(2), object(2)
memory usage: 320.0+ bytes

In [39]:
# finding maximum temprature 
df['temprature'].max()

35

In [41]:
# priting the average value
df['temprature'].mean()

30.333333333333332

In [42]:
# FIndiing minimum dataframe
df['temprature'].min()

24

In [56]:
df['temprature'].std()

3.8297084310253524

In [45]:
# FInding Five Point summary or decribing the datafrane.
df.describe()

       temprature  windspeed
count    6.000000   6.000000
mean    30.333333   4.666667
std      3.829708   2.338090
min     24.000000   2.000000
25%     28.750000   2.500000
50%     31.500000   5.000000
75%     32.000000   6.750000
max     35.000000   7.000000

In [47]:
# Finding Rws having tempature gereter than of equal to 32
df[df['temprature']>=32]

        day  temprature  windspeed  event
0  1/1/2017          32          6   Rain
1  1/2/2017          35          7  Sunny
4  1/5/2017          32          4   Rain

In [50]:
# FInding records having maximum temparture 
df[df['temprature']== df.temprature.max()]

        day  temprature  windspeed  event
1  1/2/2017          35          7  Sunny

In [51]:
# FInding records having maximum temparture 
df['day'][df['temprature']== df.temprature.max()]

1    1/2/2017
Name: day, dtype: object

In [55]:
# FInding records having maximum temparture 
df[['day','temprature']][df['temprature']== df.temprature.max()]

        day  temprature
1  1/2/2017          35

#### Set Index

In [58]:
df.index

RangeIndex(start=0, stop=6, step=1)

In [61]:
## Changing the dataframe index
df.set_index('day', inplace=True)

In [62]:
df

          temprature  windspeed  event
day
1/1/2017          32          6   Rain
1/2/2017          35          7  Sunny
1/3/2017          28          2   Snow
1/4/2017          24          7   Snow
1/5/2017          32          4   Rain
1/6/2017          31          2  Sunny

In [63]:
df.loc['1/1/2017']

temprature      32
windspeed        6
event         Rain
Name: 1/1/2017, dtype: object

In [64]:
df.reset_index(inplace= True)

In [65]:
df

        day  temprature  windspeed  event
0  1/1/2017          32          6   Rain
1  1/2/2017          35          7  Sunny
2  1/3/2017          28          2   Snow
3  1/4/2017          24          7   Snow
4  1/5/2017          32          4   Rain
5  1/6/2017          31          2  Sunny